{
    "aboutMe":"As a 21 year old entrant into the world of full-stack development, I embody a dynamic fusion of creativity, technical acumen, and a passion for collaborative innovation. What got me into coding? I'm fascinated by the intricacies of creation and the journey from conception to execution, finding immense joy in crafting digital solutions that transcend boundaries. Despite my affinity for code, my background as an athlete has instilled in me the discipline and perseverance essential for success, even from behind a desk. A natural people person, I thrive in environments where like-minded individuals converge, fueling each other's growth and pushing boundaries. With an unwavering commitment to continuous learning and a nick for problem-solving, I am poised to make meaningful contributions in the ever-evolving landscape of technology. Let's embark on the the journey of continuous learning and discovery which shapes not only our creations; but ourselves too.",
    "projects":[
        {
            "name":"Huis Course",
            "github":"https://github.com/mahmud-isaacs/capstone_project",
            "vercel":"https://capstone-project-34e36.web.app/",
            "description":"My capstone final project. Using JavaScript, Bootstrap, HTML, CSS, Node JS and MySql.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/HuisCouse.png"
        },
        {
            "name":"Pretty Simple Printz",
            "github":"https://github.com/NickiSamantha/nodeJsEomp",
            "vercel":"https://nodeeomp-5d5da.web.app/",
            "description":"A full-stack partner project. My role was backend. I used Node JS and MySql.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/Node.png"
        },
        {
            "name":"Retro Kitz",
            "github":"https://github.com/mahmud-isaacs/eomp_project",
            "vercel":"https://eomp-project.vercel.app/",
            "description":"A point of sale system built with HTML,CSS,Bootstrap and JavaScript.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/ECOM_project.png"
        },
        {
            "name":"Calculator",
            "github":"https://github.com/mahmud-isaacs/calculator",
            "vercel":"https://calculator-mocha-tau-40.vercel.app/",
            "description":"A simple calculator built with HTML, CSS and JavaScript.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/calculator.png"
        },
        {
            "name":"BMI Calculator",
            "github":"https://github.com/mahmud-isaacs/BMI_Calculator",
            "vercel":"https://bmi-calculator-three-smoky.vercel.app/",
            "description":"A simple BMI calculator built with HTML, CSS and JavaScript.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/BMI%20calculator.png"
        },
        {
            "name":"First Portfolio",
            "github":"https://github.com/mahmud-isaacs/portfolio",
            "vercel":"https://portfolio-hvoovcsm6-mahmud-isaacs-projects.vercel.app/",
            "description":"My first portfolio built with HTML,CSS,Bootstrap and JavaScript.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/first_portfolio.png"
        },
        {
            "name":"Years to days convertor",
            "github":"https://github.com/mahmud-isaacs/ageToDays",
            "vercel":"https://age-to-days-taupe.vercel.app/",
            "description":"A simple calculator that converts your age to days. Built with HTML,CSS and JavaScript.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/Years%20to%20day.png"
        }
    ],
    "education":[
        {
            "placeOfInstitution":"Life Choices Academy",
            "description":"I successfully completed a Full-stack Web Development course at Life Choices Academy. Throughout the program, I adapted to various workplace environments while mastering multiple programming skills. This experience equipped me with a strong foundation in both front-end and back-end technologies, preparing me to tackle real-world development challenges.",
            "year":"2nd April 2024 - 20th September 2024",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/LifeChoices.jpg"
        },
        {
            "placeOfInstitution":"South Peninsula High School",
            "description":"I'm a 2021 Matriculant from South Peninsula High School. My subjects included: Mathematics, English, Afrikaans, Life Orientation, Life Science, History and Business Studies.",
            "year":"2017 - 2021",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/SouthPenisula.jpg"
        }
    ],
    "skills":[
        {
            "name":"HTML",
            "level":"Proficient in HTML, my skills are at an intermediate level. I'm adept at structuring web content effectively and implementing various HTML elements to create responsive and user-friendly interfaces.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/HTML.png"
        },
        {
            "name":"CSS",
            "level":"My CSS proficiency is at an intermediate level. I have a strong grasp of styling techniques, including selectors, properties, and layout models, allowing me to create visually appealing and responsive designs for web applications.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/CSS.png"
        },
        {
            "name":"JavaScript",
            "level":"I'm currently at an intermediate level in JavaScript, having learned and practiced various concepts. I'm looking forward to deepening my understanding and continuing to apply my knowledge to create more dynamic and efficient web applications.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/js.png"
        },
        {
            "name":"BootStrap",
            "level":"I'm now more experienced in Bootstrap and excited to continue exploring its capabilities. With my improved skills, I'm eager to integrate its features into my web development projects, leveraging its pre-built components and responsive design utilities to create dynamic and visually appealing websites.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/BOOTSTRAP.jpg"
        },
        {
            "name":"Vue JS",
            "level":"I'm currently at a intermediate level with Vue, with understanding of its core concepts. I'm excited to deepen my knowledge and apply what I learn to build more interactive and responsive web applications.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/vue.png"
        },
        {
            "name":"Node JS",
            "level":"I'm currently at a beginner's level with Node.js, with a bit of understanding of its key concepts. I'm eager to enhance my skills and apply them to build efficient server-side applications, focusing on backend development to create scalable and dynamic solution.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/nodeLogo.png"
        },
        {
            "name":"MySql",
            "level":"I'm currently at a beginner's level with MySQL, with a bit of understanding of its fundamental concepts. I'm excited to further explore its capabilities and apply what I learn to manage and structure data efficiently for web applications.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/mySqlLogo.png "
        }
    ],
    "softSkills":[
        {
            "name":"Communication",
            "description":"I excel at effectively conveying ideas and information to others. I'm also a good listener, capable of understanding and responding to the needs of others. I have experience working in teams and collaborating with others to achieve common goals.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/communication.jpg"
        },
        {
            "name":"Problem Solving",
            "description":"I am a natural problem solver, skilled at identifying issues, analyzing possible solutions, and implementing effective strategies to resolve them.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/problemSolve.png"
        },
        {
            "name":"Time Management",
            "description":"I am adept at managing my time effectively, prioritizing tasks, and meeting deadlines. I am also a quick learner, able to adapt to new situations and environments, and I am eager to continue developing my skills and knowledge across various fields.",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/time%20mang.png"
        }
    ],

    "experience":[
        {
            "placeOfInstitution":"Life Choices Studio",
            "description":"I'm currently interning at Life Choices Studio as I pursue my goal of becoming a Full-Stack Developer. Throughout this experience, I've gained valuable workplace experience while actively upskilling and enhancing my programming abilities.",
            "year":"25th September 2024 - present",
            "image":"https://mahmud-isaacs.github.io/portfolio_hostedImages/images/studio.jpg"
        }
    ]
}